In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
%matplotlib inline

In [2]:
events_data = pd.read_csv('event_data_train.csv')
submission_data = pd.read_csv('submissions_data_train.csv')

In [3]:
events_data['date'] = pd.to_datetime(events_data.timestamp, unit = 's')
events_data['day'] = events_data.date.dt.date

In [4]:
submission_data['date'] = pd.to_datetime(submission_data.timestamp, unit = 's')
submission_data['day'] = submission_data.date.dt.date

In [5]:
users_data = events_data.groupby('user_id', as_index= False)\
        .agg({'timestamp': 'max'})\
        .rename({'timestamp':'last_timestamp'}, axis = 'columns')

In [6]:
now = 1526772811
drop_out_threasold = 2592000

In [7]:
users_scores = submission_data.pivot_table(index='user_id',\
                        columns = 'submission_status',\
                        values = 'step_id',\
                        aggfunc = 'count',\
                        fill_value = 0)\
                        .reset_index()

In [8]:
users_data['is_gone_user'] = (now - users_data.last_timestamp) > drop_out_threasold

In [9]:
users_data = users_data.merge(users_scores, on = 'user_id', how = 'outer')
users_data = users_data.fillna(0)

In [10]:
users_invent_data = events_data.pivot_table(index = 'user_id',
                        columns = 'action',
                        values  = 'step_id',
                        aggfunc = 'count',
                        fill_value = 0).reset_index()

In [11]:
users_data = users_data.merge(users_invent_data, how = 'outer')
users_days = events_data.groupby('user_id').day.nunique()

In [12]:
users_days.to_frame().reset_index()
users_data = users_data.merge(users_days, on = 'user_id', how = 'outer')

In [13]:
users_data['passed_corse'] = users_data.passed > 170

In [14]:
users_data.head()

,user_id,last_timestamp,is_gone_user,correct,wrong,discovered,passed,started_attempt,viewed,day,passed_corse
0,1,1472827464,True,0.0,0.0,1,0,0,1,1,False
1,2,1519226966,True,2.0,0.0,9,9,2,10,2,False
2,3,1444581588,True,29.0,23.0,91,87,30,192,7,False
3,5,1499859939,True,2.0,2.0,11,11,4,12,2,False
4,7,1521634660,True,0.0,0.0,1,1,0,1,1,False

In [15]:
events_data.head()

   step_id   timestamp      action  user_id                date         day
0    32815  1434340848      viewed    17632 2015-06-15 04:00:48  2015-06-15
1    32815  1434340848      passed    17632 2015-06-15 04:00:48  2015-06-15
2    32815  1434340848  discovered    17632 2015-06-15 04:00:48  2015-06-15
3    32811  1434340895  discovered    17632 2015-06-15 04:01:35  2015-06-15
4    32811  1434340895      viewed    17632 2015-06-15 04:01:35  2015-06-15

In [16]:
user_min_time = events_data.groupby('user_id',as_index = False) \
.agg({'timestamp': 'min'}).rename({'timestamp' :'min_timestamp'},axis = 1)

In [17]:
user_min_time.head(3)

   user_id  min_timestamp
0        1     1472827464
1        2     1514383364
2        3     1434358476

In [18]:
users_data = users_data.merge(user_min_time,how = 'outer')
users_data.head()

,user_id,last_timestamp,is_gone_user,correct,wrong,discovered,passed,started_attempt,viewed,day,passed_corse,min_timestamp
0,1,1472827464,True,0.0,0.0,1,0,0,1,1,False,1472827464
1,2,1519226966,True,2.0,0.0,9,9,2,10,2,False,1514383364
2,3,1444581588,True,29.0,23.0,91,87,30,192,7,False,1434358476
3,5,1499859939,True,2.0,2.0,11,11,4,12,2,False,1466156809
4,7,1521634660,True,0.0,0.0,1,1,0,1,1,False,1521634660

In [19]:
events_data['user_time'] = events_data.user_id.map(str) + '_' \
                         + events_data.timestamp.map(str)

In [20]:
events_data.head()

,step_id,timestamp,action,user_id,date,day,user_time
0,32815,1434340848,viewed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848
1,32815,1434340848,passed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848
2,32815,1434340848,discovered,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848
3,32811,1434340895,discovered,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895
4,32811,1434340895,viewed,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895

In [21]:
learning_time_threshold = 3*24*60*60
learning_time_threshold

259200

In [22]:
user_min_time.head()

   user_id  min_timestamp
0        1     1472827464
1        2     1514383364
2        3     1434358476
3        5     1466156809
4        7     1521634660

In [23]:
user_learning_time_threshold = user_min_time.user_id.map(str) + '_' + \
                            (user_min_time.min_timestamp +learning_time_threshold ) \
                                                            .map(str)
user_learning_time_threshold.head()

0    1_1473086664
1    2_1514642564
2    3_1434617676
3    5_1466416009
4    7_1521893860
dtype: object

In [24]:
user_min_time['user_learning_time_threshold'] = user_learning_time_threshold
user_min_time.head()

   user_id  min_timestamp user_learning_time_threshold
0        1     1472827464                 1_1473086664
1        2     1514383364                 2_1514642564
2        3     1434358476                 3_1434617676
3        5     1466156809                 5_1466416009
4        7     1521634660                 7_1521893860

In [25]:
events_data = events_data.merge \
                    (user_min_time[['user_id','user_learning_time_threshold']] ,
                                how = 'outer')

In [26]:
events_data.head()

,step_id,timestamp,action,user_id,date,day,user_time,user_learning_time_threshold
0,32815,1434340848,viewed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
1,32815,1434340848,passed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
2,32815,1434340848,discovered,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
3,32811,1434340895,discovered,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895,17632_1434600048
4,32811,1434340895,viewed,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895,17632_1434600048

In [27]:
events_data_train = events_data[events_data.user_time <= events_data.user_learning_time_threshold]
events_data_train.head()

,step_id,timestamp,action,user_id,date,day,user_time,user_learning_time_threshold
0,32815,1434340848,viewed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
1,32815,1434340848,passed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
2,32815,1434340848,discovered,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
3,32811,1434340895,discovered,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895,17632_1434600048
4,32811,1434340895,viewed,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895,17632_1434600048

In [28]:
submissions_data = submission_data
submissions_data['users_time'] = submissions_data.user_id.map(str) + '_' + submissions_data.timestamp.map(str)
submissions_data = submissions_data.merge(user_min_time[['user_id', 'user_learning_time_threshold']], how='outer')
submissions_data_train = submissions_data[submissions_data.users_time <= submissions_data.user_learning_time_threshold]
submissions_data_train.groupby('user_id').day.nunique().max()

4

In [29]:
submissions_data_train.head()

,step_id,timestamp,submission_status,user_id,date,day,users_time,user_learning_time_threshold
0,31971.0,1.434349e+09,correct,15853,2015-06-15 06:21:15,2015-06-15,15853_1434349275,15853_1434605177
1,31972.0,1.434348e+09,correct,15853,2015-06-15 06:05:00,2015-06-15,15853_1434348300,15853_1434605177
4,31976.0,1.434348e+09,wrong,15853,2015-06-15 06:02:03,2015-06-15,15853_1434348123,15853_1434605177
5,31976.0,1.434348e+09,correct,15853,2015-06-15 06:03:08,2015-06-15,15853_1434348188,15853_1434605177
7,31977.0,1.434347e+09,correct,15853,2015-06-15 05:49:31,2015-06-15,15853_1434347371,15853_1434605177

In [30]:
X = submissions_data_train.groupby('user_id').day.nunique().to_frame().reset_index() \
.rename(columns = {'day' : 'days'})

In [31]:
X.head()

   user_id  days
0        2     1
1        3     1
2        8     1
3       14     1
4       16     3

In [32]:
steps_tried = submissions_data_train.groupby('user_id').step_id.nunique() \
.to_frame().reset_index().rename(columns ={'step_id' : 'steps_tried'})

In [33]:
steps_tried.head()

   user_id  steps_tried
0        2            2
1        3            4
2        8           11
3       14            1
4       16           23

In [34]:
X = X.merge(steps_tried, on = 'user_id', how = 'outer')

In [35]:
X.head()

   user_id  days  steps_tried
0        2     1            2
1        3     1            4
2        8     1           11
3       14     1            1
4       16     3           23

In [36]:
submissions_data_train.head()

,step_id,timestamp,submission_status,user_id,date,day,users_time,user_learning_time_threshold
0,31971.0,1.434349e+09,correct,15853,2015-06-15 06:21:15,2015-06-15,15853_1434349275,15853_1434605177
1,31972.0,1.434348e+09,correct,15853,2015-06-15 06:05:00,2015-06-15,15853_1434348300,15853_1434605177
4,31976.0,1.434348e+09,wrong,15853,2015-06-15 06:02:03,2015-06-15,15853_1434348123,15853_1434605177
5,31976.0,1.434348e+09,correct,15853,2015-06-15 06:03:08,2015-06-15,15853_1434348188,15853_1434605177
7,31977.0,1.434347e+09,correct,15853,2015-06-15 05:49:31,2015-06-15,15853_1434347371,15853_1434605177

In [37]:
X = X.merge(submissions_data_train.pivot_table(index='user_id',\
                        columns = 'submission_status',\
                        values = 'step_id',\
                        aggfunc = 'count',\
                        fill_value = 0)\
                        .reset_index())

In [38]:
X['correct_ration'] = X.correct / (X.correct + X.wrong)

In [39]:
X.head()

   user_id  days  steps_tried  correct  wrong  correct_ration
0        2     1            2        2      0            1.00
1        3     1            4        4      4            0.50
2        8     1           11        9     21            0.30
3       14     1            1        0      1            0.00
4       16     3           23       23     27            0.46

In [40]:
events_data_train.head()

,step_id,timestamp,action,user_id,date,day,user_time,user_learning_time_threshold
0,32815,1434340848,viewed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
1,32815,1434340848,passed,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
2,32815,1434340848,discovered,17632,2015-06-15 04:00:48,2015-06-15,17632_1434340848,17632_1434600048
3,32811,1434340895,discovered,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895,17632_1434600048
4,32811,1434340895,viewed,17632,2015-06-15 04:01:35,2015-06-15,17632_1434340895,17632_1434600048

In [41]:
X = X.merge(events_data_train.pivot_table(index='user_id',\
                        columns = 'action',\
                        values = 'step_id',\
                        aggfunc = 'count',\
                        fill_value = 0)\
                        .reset_index()[['user_id','viewed']], how = 'outer')

In [42]:
X = X.fillna(0)

In [43]:
X.head()

   user_id  days  steps_tried  correct  wrong  correct_ration  viewed
0        2   1.0          2.0      2.0    0.0            1.00       9
1        3   1.0          4.0      4.0    4.0            0.50      20
2        8   1.0         11.0      9.0   21.0            0.30     154
3       14   1.0          1.0      0.0    1.0            0.00       9
4       16   3.0         23.0     23.0   27.0            0.46     132

In [44]:
users_data.head()

,user_id,last_timestamp,is_gone_user,correct,wrong,discovered,passed,started_attempt,viewed,day,passed_corse,min_timestamp
0,1,1472827464,True,0.0,0.0,1,0,0,1,1,False,1472827464
1,2,1519226966,True,2.0,0.0,9,9,2,10,2,False,1514383364
2,3,1444581588,True,29.0,23.0,91,87,30,192,7,False,1434358476
3,5,1499859939,True,2.0,2.0,11,11,4,12,2,False,1466156809
4,7,1521634660,True,0.0,0.0,1,1,0,1,1,False,1521634660

In [45]:
X = X.merge(users_data[['user_id','is_gone_user','passed_corse']], how = 'outer')

In [46]:
X.head()

,user_id,days,steps_tried,correct,wrong,correct_ration,viewed,is_gone_user,passed_corse
0,2,1.0,2.0,2.0,0.0,1.00,9,True,False
1,3,1.0,4.0,4.0,4.0,0.50,20,True,False
2,8,1.0,11.0,9.0,21.0,0.30,154,True,False
3,14,1.0,1.0,0.0,1.0,0.00,9,True,False
4,16,3.0,23.0,23.0,27.0,0.46,132,True,True

In [47]:
X = X[~((X.is_gone_user == False) & (X.passed_corse == False))]

In [48]:
X.head()

,user_id,days,steps_tried,correct,wrong,correct_ration,viewed,is_gone_user,passed_corse
0,2,1.0,2.0,2.0,0.0,1.00,9,True,False
1,3,1.0,4.0,4.0,4.0,0.50,20,True,False
2,8,1.0,11.0,9.0,21.0,0.30,154,True,False
3,14,1.0,1.0,0.0,1.0,0.00,9,True,False
4,16,3.0,23.0,23.0,27.0,0.46,132,True,True

In [49]:
X.groupby(['passed_corse' ,'is_gone_user' ]).user_id.count()

passed_corse  is_gone_user
False         True            16560
True          False             141
              True             1284
Name: user_id, dtype: int64

In [50]:
y = X.passed_corse.map(int)

In [51]:
X = X.drop(['is_gone_user', 'passed_corse'], axis = 1)

In [52]:
X = X.set_index('user_id')

In [53]:
X.head()

         days  steps_tried  correct  wrong  correct_ration  viewed
user_id
2         1.0          2.0      2.0    0.0            1.00       9
3         1.0          4.0      4.0    4.0            0.50      20
8         1.0         11.0      9.0   21.0            0.30     154
14        1.0          1.0      0.0    1.0            0.00       9
16        3.0         23.0     23.0   27.0            0.46     132

In [54]:
from sklearn.ensemble import RandomForestClassifier
clf_rf = RandomForestClassifier()

In [63]:
params = [{'n_estimators' : range(11,30), 'max_depth' : range(1,40) 
           , 'min_samples_leaf' : range(10,300) , 'min_samples_split' :range(10,300)}]

In [56]:
from sklearn.model_selection import RandomizedSearchCV

In [64]:
search_cv = RandomizedSearchCV(clf_rf, params, cv = 5)

In [58]:
from sklearn.model_selection import train_test_split
X_train, X_test , Y_train ,Y_test = train_test_split(X,y,test_size = 0.25)

In [65]:
search_cv.fit(X_train,Y_train)

RandomizedSearchCV(cv=5, error_score=nan,
                   estimator=RandomForestClassifier(bootstrap=True,
                                                    ccp_alpha=0.0,
                                                    class_weight=None,
                                                    criterion='gini',
                                                    max_depth=None,
                                                    max_features='auto',
                                                    max_leaf_nodes=None,
                                                    max_samples=None,
                                                    min_impurity_decrease=0.0,
                                                    min_impurity_split=None,
                                                    min_samples_leaf=1,
                                                    min_samples_split=2,
                                                    min_weight_fraction_leaf=0.0,
                                                    n_estimators=100,
                                                    n_jobs=None,
                                                    oob_score=False,
                                                    random_state=None,
                                                    verbose=0,
                                                    warm_start=False),
                   iid='deprecated', n_iter=10, n_jobs=None,
                   param_distributions=[{'max_depth': range(1, 40),
                                         'min_samples_leaf': range(10, 300),
                                         'min_samples_split': range(10, 300),
                                         'n_estimators': range(11, 30)}],
                   pre_dispatch='2*n_jobs', random_state=None, refit=True,
                   return_train_score=False, scoring=None, verbose=0)

In [66]:
search_cv.score(X_test, Y_test)

0.9215032243718034

In [67]:
search_cv.score(X_train, Y_train)

0.92497034400949

In [68]:
search_cv.best_params_

{'n_estimators': 27,
 'min_samples_split': 149,
 'min_samples_leaf': 69,
 'max_depth': 14}